Show / Hide Table of Contents
Enum TypeDeflectionSheme
Scheme
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum TypeDeflectionSheme
Fields
 Name |  Description
 DeflectionSheme_I
constant moment - single span
 DeflectionSheme_II
one single force - single span
 DeflectionSheme_III
single moment at the begging or end of the span - single span
 DeflectionSheme_IV
two forces - single span
 DeflectionSheme_IX
triangle distributed loads - cantilever
 DeflectionSheme_V
linear distributed loads - single span
 DeflectionSheme_VI
triangle distributed loads - single span
 DeflectionSheme_VII
linear distributed loads, moments in the left and right - continues beam
 DeflectionSheme_VIII
one single force - cantilever
 DeflectionSheme_X
one single force - non continues span
 DeflectionSheme_XI
trapezoidal shape of loads
 Improve this Doc
 View Source